Autodesk.Revit.DB.Structure.RebarConstrainedHandle.IsDraggable
Checks that the RebarConstrainedHandle can be draggable in canvas (it has drag controls while editing constraints).
Returns:
Returns true if the RebarConstrainedHandle can be draggable in canvas (it has drag controls while editing constraints).
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.AllowsConstraintToCustomTarget
Checks if the RebarConstrainedHandle allows constraint of Autodesk::Revit::DB::Structure::RebarConstraintType::ToCustomTarget type.
Returns:
Returns true if the RebarConstrainedHandle allows constraint of Autodesk::Revit::DB::Structure::RebarConstraintType::ToCustomTarget type.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.AllowsConstraintToSurface
Checks if the RebarConstrainedHandle allows constraint of Autodesk::Revit::DB::Structure::RebarConstraintType::ToSurface type.
Returns:
Returns true if the RebarConstrainedHandle allows constraint of Autodesk::Revit::DB::Structure::RebarConstraintType::ToSurface type.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.AllowsConstraintToOtherRebarEdge
Checks if the RebarConstrainedHandle allows constraint of Autodesk::Revit::DB::Structure::RebarConstraintType::ToOtherRebar type, where target is Autodesk::Revit::DB::Structure::RebarConstraintType::TargetRebarConstraintType::Edge.
Returns:
Returns true if the RebarConstrainedHandle allows constraint of Autodesk::Revit::DB::Structure::RebarConstraintType::ToOtherRebar type, where target is Autodesk::Revit::DB::Structure::RebarConstraintType::TargetRebarConstraintType::Edge.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.AllowsDistanceToHostEdgeOrHostEdgeCover
Checks if the RebarConstrainedHandle allows distance for a constraint of Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdge or Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdgeCover type.
Returns:
Returns true if the RebarConstrainedHandle allows distance for a constraint of Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdge or Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdgeCover type, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstrainedHandle doesn't allow constraint of RebarConstraintType.ToHostEdge or RebarConstraintType.ToHostEdgeCover type.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.AllowsConstraintToHostEdgeCover
Checks if the RebarConstrainedHandle allows constraint of Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdgeCover type.
Returns:
Returns true if the RebarConstrainedHandle allows constraint of Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdgeCover type.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.AllowsConstraintToHostEdge
Checks if the RebarConstrainedHandle allows constraint of Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdge type.
Returns:
Returns true if the RebarConstrainedHandle allows constraint of Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdge type.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.AllowsConstraintToHostFaceOrToCover
Checks if the RebarConstrainedHandle allows constraint of Autodesk::Revit::DB::Structure::RebarConstraintType::FixedDistanceToHostFace or Autodesk::Revit::DB::Structure::RebarConstraintType::ToCover type.
Returns:
Returns true if the RebarConstrainedHandle allows constraint of Autodesk::Revit::DB::Structure::RebarConstraintType::FixedDistanceToHostFace or Autodesk::Revit::DB::Structure::RebarConstraintType::ToCover type.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.GetRebarConstraintsManager
Gets the RebarConstraintsManager that is associated with this handle.
Returns:
Return the RebarConstraintsManager that is associated with this handle.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.Move(Autodesk.Revit.DB.XYZ)
Moves the handle with the specified vector.
Remarks:
This function applies for all handles of a shape driven rebar.
This function applies only for handles of a free form rebar that are draggable in canvas (they have drag controls while editing constraints).
translation:
The translation vector that will be applied.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstrainedHandle is no longer valid.
-or-
The RebarConstrainedHandle cannot be dragged.
Since:
2025

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.GetHandlePosition(Autodesk.Revit.DB.View)
Gets the position of this handle as it is while editing constraints.
view:
The view in which the position is requested.
Returns:
Returns the position of this handle as it is while editing constraints.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstrainedHandle is no longer valid.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.GetHandleSurface
Gets the surface of this handle.
Remarks:
This function takes into account the handle behavior.
This function works only for shape driven rebar.
Usualy the return surface is a plane. Only for segments of bars whose shape has a RebarShapeDefinitionByArc will return a cylindrical surface.
Returns:
Returns the surface of this handle.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstrainedHandle is no longer valid.
-or-
This handle doesn't belong to a shape driven rebar.
Since:
2025

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.GetEdgeNumber
If the RebarConstrainedHandle's RebarHandleType is 'Edge',
then this function will return the number of the edge that is
driven by the handle.
Returns:
Returns the number of the edge that is driven by the handle.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstrainedHandle is no longer valid.
-or-
The RebarConstrainedHandle is not of RebarHandleType 'Edge'.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstrainedHandle
A class representing a handle on a Rebar that can be joined to a reference, such
as a host Element's surface or cover, another Rebar's handle or to a generic surface.
Remarks:
A rebar element's flexible geometry is controlled by several handles. For example,
the shape of a shape driven rebar is controlled by a handle at each end of the bar and a handle each edge.
Another handle is used to control the location of the plane in which the rebar lies.
An additional handle controls the length of a set of rebar.
RebarConstrainedHandles can only be constructed internally by Revit. They are
available to the API by querying a Rebar element's RebarConstraintsManager.
Since:
2014